Figure_18/zfs_qat_test/silesia_chunk_4kread_lat_test/latency_res/09_29-10_56/nocomp/16K/out_09_29-10_58_03.txt
#############################################################
align: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.35-118-g4a0c76
Starting 1 process

align: (groupid=0, jobs=1): err= 0: pid=3736: Sun Sep 29 10:59:10 2024
  read: IOPS=5866, BW=22.9MiB/s (24.0MB/s)(1513MiB/66011msec)
    clat (usec): min=4, max=709, avg=85.41, stdev=24.71
     lat (usec): min=4, max=709, avg=85.43, stdev=24.71
    clat percentiles (usec):
     |  1.00th=[   67],  5.00th=[   70], 10.00th=[   71], 20.00th=[   73],
     | 30.00th=[   75], 40.00th=[   77], 50.00th=[   79], 60.00th=[   82],
     | 70.00th=[   88], 80.00th=[   98], 90.00th=[  104], 95.00th=[  111],
     | 99.00th=[  198], 99.50th=[  265], 99.90th=[  326], 99.95th=[  388],
     | 99.99th=[  498]
   bw (  KiB/s): min= 7480, max=29728, per=100.00%, avg=23501.44, stdev=3702.44, samples=131
   iops        : min= 1870, max= 7432, avg=5875.35, stdev=925.61, samples=131
  lat (usec)   : 10=0.16%, 20=0.01%, 50=0.05%, 100=83.94%, 250=15.31%
  lat (usec)   : 500=0.53%, 750=0.01%
  cpu          : usr=50.08%, sys=7.88%, ctx=391388, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=100.0%, 4=0.1%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=387238,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=22.9MiB/s (24.0MB/s), 22.9MiB/s-22.9MiB/s (24.0MB/s-24.0MB/s), io=1513MiB (1586MB), run=66011-66011msec
 
zfs_prefetch_disable: 1
zfs_arc_max_val: 0
zfs_arc_min_val: 0
zfs_qat_compress_disable: 
 
compress_type: NAME         PROPERTY     VALUE           SOURCE
mypool/myfs  compression  off             local
 
blocksize: NAME         PROPERTY    VALUE    SOURCE
mypool/myfs  recordsize  16K      local
 
iters: 2
output_path: ./latency_res/09_29-10_56/nocomp/16K